; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v2)
		(pred_5 ?v5)
		(pred_4 ?v4)
		(pred_3 ?v4)
		(pred_6 ?v5 ?v4)
		(pred_1)
		(pred_2 ?v5))

   (:action op_3
       :parameters  (?v8 ?v7)
       :precondition (and (not-eq ?v8 ?v7) 
                          (pred_4 ?v8) (pred_4 ?v7) (pred_3 ?v8))
       :effect (and  (pred_3 ?v7)
		     (not (pred_3 ?v8))))


   (:action op_2
       :parameters (?v6 ?v1)
       :precondition  (and  (pred_5 ?v6) (pred_4 ?v1)
			    (pred_6 ?v6 ?v1) (pred_3 ?v1) (pred_1))
       :effect (and (pred_2 ?v6)
		    (not (pred_6 ?v6 ?v1)) 
		    (not (pred_1))))

   (:action op_1
       :parameters  (?v6  ?v1)
       :precondition  (and  (pred_5 ?v6) (pred_4 ?v1)
			    (pred_2 ?v6) (pred_3 ?v1))
       :effect (and (pred_6 ?v6 ?v1)
		    (pred_1)
		    (not (pred_2 ?v6)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_06 obj_02 obj_07 obj_01 obj_05 
          obj_03 obj_04 
)
(:init
(pred_4 obj_06)
(pred_4 obj_02)
(pred_4 obj_07)
(pred_4 obj_01)
(pred_4 obj_05)
(pred_5 obj_03)
(pred_5 obj_04)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(pred_1)
(pred_6 obj_03 obj_05)
(pred_6 obj_04 obj_06)
(pred_3 obj_02)
)
(:goal
(and
(pred_6 obj_03 obj_01)
(pred_6 obj_04 obj_06)
)
)

(:constraints
  (sometime-before  (pred_6 obj_03 obj_01) (pred_3 obj_06))
)
)

; plan
1. (op_3 obj_02 obj_05)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_05)
   goals met: 1 of 2
2. (op_2 obj_03 obj_05)
   deleted: (pred_6 obj_03 obj_05) (pred_1)
   added: (pred_2 obj_03)
   goals met: 1 of 2
3. (op_3 obj_05 obj_06)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_06)
   goals met: 1 of 2
4. (op_1 obj_03 obj_06)
   deleted: (pred_2 obj_03)
   added: (pred_6 obj_03 obj_06) (pred_1)
   goals met: 1 of 2
5. (op_2 obj_04 obj_06)
   deleted: (pred_6 obj_04 obj_06) (pred_1)
   added: (pred_2 obj_04)
   goals met: 0 of 2
6. (op_3 obj_06 obj_01)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_01)
   goals met: 0 of 2
7. (op_1 obj_04 obj_01)
   deleted: (pred_2 obj_04)
   added: (pred_6 obj_04 obj_01) (pred_1)
   goals met: 0 of 2
8. (op_3 obj_01 obj_06)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_06)
   goals met: 0 of 2
9. (op_2 obj_03 obj_06)
   deleted: (pred_6 obj_03 obj_06) (pred_1)
   added: (pred_2 obj_03)
   goals met: 0 of 2
10. (op_3 obj_06 obj_01)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_01)
   goals met: 0 of 2
11. (op_1 obj_03 obj_01)
   deleted: (pred_2 obj_03)
   added: (pred_6 obj_03 obj_01) (pred_1)
   goals met: 1 of 2
12. (op_2 obj_04 obj_01)
   deleted: (pred_6 obj_04 obj_01) (pred_1)
   added: (pred_2 obj_04)
   goals met: 1 of 2
13. (op_3 obj_01 obj_06)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_06)
   goals met: 1 of 2
14. (op_1 obj_04 obj_06)
   deleted: (pred_2 obj_04)
   added: (pred_6 obj_04 obj_06) (pred_1)
   goals met: 2 of 2
